{
  "portfolio":[
    {
      "title" : "DRPP Simulator",
      "date"  : "June, 2015",
      "quote" : "Build in Java",
      "img"   : "DRPP_thumb.gif",
      "intro" : "DRPP is an acronym of Delegation-based Roaming Payment Protocol. With JPBC Library, this simulator is able to compute the execution time of each step in our protocol. Monitor tab shows the values that the variables hold, so we can make sure everything works properly."
    },{
      "title" : "Jewels",
      "date"  : "February, 2011",
      "quote" : "Build in Android 2.2",
      "img"   : "jewels_thumb.gif",
      "intro" : "This is my undergraduate final project during the junior year. We used Android to build a match-three puzzle game since Android was very popular then.<br>It's my first time to develop a program with multi-thread and learn how to leverage double buffering to make animation smoothly."
    },{
      "title" : "Rabin Simulator",
      "date"  : "January, 2014",
      "quote" : "Build in Java",
      "img"   : "rabin_thumb.gif",
      "intro" : "This program adopts Miller-Rabin algorithm to generate a large prime and encrypt the input message with Rabin algorithm. Since we will get 4 outputs after decryption, we use Jacobi symbol to find out which one is the plain text."
    },{
      "title" : "K-means Demo",
      "date"  : "January, 2014",
      "quote" : "Build in Java",
      "img"   : "kmeans_thumb.gif",
      "intro" : "This program can simulate the process of K-means algorithm. By changing the time interval, you can adjust animation's delay to slow down the process."
    },{
      "title" : "Roboter",
      "date"  : "January, 2015",
      "quote" : "Build in Java",
      "img"   : "roboter_thumb.gif",
      "intro" : "While being a teacher assistant, I usually have to check out many projects. So I wrote this program to compile, verify, and score the students' C++ files automatically. Multi-thread is involved in case someone's program crashed."
    },{
      "title" : "Watch Dog",
      "date"  : "January, 2015",
      "quote" : "Build in Java",
      "img"   : "watchdog_thumb.gif",
      "intro" : "This program can automatically compare the students' source codes by using bag-of-words model. You can adjust the similarity to get better results. <q>Best performance is at around 80%</q>"
    },{
      "title" : "Stock Monitor",
      "date"  : "Around 2012",
      "quote" : "Build in Java",
      "img"   : "stock_thumb.gif",
      "intro" : "One day, my friend's father asked me if I can write a stock monitor with some formulas invented by him, and that is why I developed this program.  <q>The data model in this program is just an example.</q>"
    },{
      "title" : "Small World",
      "date"  : "February, 2015",
      "quote" : "Build in Java",
      "img"   : "small_thumb.gif",
      "intro" : "I wrote this program to practice physics simulation and collision detection in Java. You can draw your own map and jump everywhere."
    }
  ]
}